STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_ca35.h
/*
 * @brief USB3 BC Register Block
 */

typedef struct
{
  __IO uint32_t BCFG;             /*!< (null) @ offset 0x0 */
       uint32_t RESERVED18;       /*!< Reserved @ offset 0x4 */
  __IO uint32_t BCEVT;            /*!< (null) @ offset 0x8 */
  __IO uint32_t BCEVTEN;          /*!< (null) @ offset 0xc */
       uint32_t RESERVED19[240];  /*!< (null) @ offset 0x10-0x3CC */
} USB3_BC_TypeDef;

/*
 * @brief USB3 LINK Register Block
 */

typedef struct
{
  __IO uint32_t LU1LFPSRXTIM;   /*!< (null) @ offset 0x0 */
       uint32_t RESERVED20[7];  /*!< Reserved @ offset 0x4-0x1C */
  __IO uint32_t SETTINGS;       /*!< (null) @ offset 0x20 */
  __IO uint32_t LLUCTL;         /*!< (null) @ offset 0x24 */
  __IO uint32_t LPTMDPDELAY;    /*!< (null) @ offset 0x28 */
} USB3_LINK_TypeDef;

/*
 * @brief USB3 Register Block
 */

typedef struct
{
  uint32_t RESERVED[0xC100/4];      /*!< Reserved              @ offset 0x0   */
  USB3_GBL_TypeDef GBLREGS;         /*!< Global Register Block @ offset 0xc100 */
  USB3_DEV_TypeDef DEVREGS;         /*!< Global Register Block @ offset 0xc700 */
  USB3_BC_TypeDef BCREGS;           /*!< Global Register Block @ offset 0xcc00 */
  USB3_LINK_TypeDef LINKREGS;       /*!< Global Register Block @ offset 0xd000 */
} USB3_TypeDef;

/**
  * @brief VREFBUF
  */
typedef struct
{
  __IO uint32_t CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

/*
 * @brief Window Watchdog (WWDG)
 */
typedef struct
{
  __IO uint32_t CR;              /*!< Control register                     Address offset: 0x000 */
  __IO uint32_t CFR;             /*!< Configuration register               Address offset: 0x004 */
  __IO uint32_t SR;              /*!< Status register                      Address offset: 0x008 */
       uint32_t RESERVED0[249];  /*!< Reserved                             Address offset: 0x00C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< WWDG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< WWDG version register                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< WWDG ID register                     Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< WWDG size ID register                Address offset: 0x3FC */
} WWDG_TypeDef;

/**
  * @}
  */

/**
 * @}
 */

/** @addtogroup Peripheral_declaration
  * @{
  */
/**
 * @brief stm32mp2 base addresses Definitions :
 */
#define PERIPH_SIZE                         (0x10000000UL)  /*!< Size of : AHB/APB Peripherals                                  */

#define SRAMS_SIZE                          (0x10000000UL)  /*!< Size of : SRAMs memory region                                  */

#define SYSRAM_SIZE                         ( 256UL *1024UL) /*!< Unit is Byte                                                   */
#define SRAM1_SIZE                          ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define SRAM2_SIZE                          ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define RETRAM_SIZE                         ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define VDERAM_SIZE                         ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define BKP_SRAM_SIZE                       (   8UL *1024UL) /*!< Unit is Byte                                                   */
#define CAN_SRAM_SIZE                       (  10UL *1024UL) /*!< Unit is Byte                                                   */
#define DDR_SIZE                            (2048UL * 1024UL * 1024UL) /*!< Unit is Byte                                       */

#define MPU_AXI_BUS_MEMORY_BASE             (0x50000000UL) /*!< Base address of : AXI Bus                                       */

#define OSPI1_MEM_BASE                      (MPU_AXI_BUS_MEMORY_BASE + 0x10000000UL) /*!< Base address of : OSPI1 memory  accessible over AXI    */
#define OSPI2_MEM_BASE                      (MPU_AXI_BUS_MEMORY_BASE + 0x18000000UL) /*!< Base address of : OSPI2 memory  accessible over AXI    */
#define FMC_NOR_MEM_BASE                    (MPU_AXI_BUS_MEMORY_BASE + 0x20000000UL) /*!< Base address of : FMC NOR memories  accessible over AXI */
#define DDR_MEM_BASE                        (MPU_AXI_BUS_MEMORY_BASE + 0x30000000UL) /*!< Base address of : DDR (DRAM) over AXI                   */

/*!< Peripherals */
#define PERIPH_BASE                         (0x40000000UL)  /*!< Base address of : AHB/APB Peripherals                          */

/*!< Memories */
#define SRAMS_BASE                          (0x20000000UL)  /*!< Base address of : SRAMs region                                 */

#define SYSRAM_BASE                         (SRAMS_BASE + 0x00000000UL)     /*!< Base address of : System RAM accessible over AXI         */
#define SRAM1_BASE                          (SRAMS_BASE + 0x00040000UL)     /*!< Base address of : static data RAM1                       */
#define SRAM2_BASE                          (SRAMS_BASE + 0x00060000UL)     /*!< Base address of : static data RAM2                       */
#define RETRAM_BASE                         (SRAMS_BASE + 0x00080000UL)     /*!< Base address of : Retention RAM                          */
#define VDERAM_BASE                         (SRAMS_BASE + 0x000A0000UL)     /*!< Base address of : VIDEO ENCODE/DECODE static RAM         */
#define BKP_SRAM_BASE                       (0x42000000UL)                  /*!< Base address of : backup static  RAM                     */
#define CAN_SRAM_BASE                       (0x40310000UL)                  /*!< Base address of : CAN static  RAM                        */

/*!< Peripheral buses */
#define APB1_PERIPH_BASE                    (PERIPH_BASE + 0x00000000UL)
#define APB2_PERIPH_BASE                    (PERIPH_BASE + 0x00200000UL)
#define AHB2_PERIPH_BASE                    (PERIPH_BASE + 0x00400000UL)
#define AHB3_PERIPH_BASE                    (PERIPH_BASE + 0x02000000UL)
#define APB3_PERIPH_BASE                    (PERIPH_BASE + 0x04000000UL)
#define AHB4_PERIPH_BASE                    (PERIPH_BASE + 0x04200000UL)
#define SMART_RUN_APB_PERIPH_BASE           (PERIPH_BASE + 0x06000000UL)
#define SMART_RUN_AHB_PERIPH_BASE           (PERIPH_BASE + 0x06200000UL)
#define APB4_PERIPH_BASE                    (PERIPH_BASE + 0x08000000UL)
#define AHB5_PERIPH_BASE                    (PERIPH_BASE + 0x08200000UL)
#define APB_DEBUG_PERIPH_BASE               (PERIPH_BASE + 0x0A000000UL)
#define AHB6_PERIPH_BASE                    (PERIPH_BASE + 0x0B000000UL)

/*!< APB1 peripherals */
#define TIM2_BASE                           (APB1_PERIPH_BASE + 0x000000UL)
#define TIM3_BASE                           (APB1_PERIPH_BASE + 0x010000UL)
#define TIM4_BASE                           (APB1_PERIPH_BASE + 0x020000UL)
#define TIM5_BASE                           (APB1_PERIPH_BASE + 0x030000UL)
#define TIM6_BASE                           (APB1_PERIPH_BASE + 0x040000UL)
#define TIM7_BASE                           (APB1_PERIPH_BASE + 0x050000UL)
#define TIM12_BASE                          (APB1_PERIPH_BASE + 0x060000UL)
#define TIM13_BASE                          (APB1_PERIPH_BASE + 0x070000UL)
#define TIM14_BASE                          (APB1_PERIPH_BASE + 0x080000UL)
#define LPTIM1_BASE                         (APB1_PERIPH_BASE + 0x090000UL)
#define LPTIM2_BASE                         (APB1_PERIPH_BASE + 0x0A0000UL)
#define SPI2_BASE                           (APB1_PERIPH_BASE + 0x0B0000UL)
#define SPI3_BASE                           (APB1_PERIPH_BASE + 0x0C0000UL)
#define SPDIFRX_BASE                        (APB1_PERIPH_BASE + 0x0D0000UL)
#define USART2_BASE                         (APB1_PERIPH_BASE + 0x0E0000UL)
#define USART3_BASE                         (APB1_PERIPH_BASE + 0x0F0000UL)
#define UART4_BASE                          (APB1_PERIPH_BASE + 0x100000UL)
#define UART5_BASE                          (APB1_PERIPH_BASE + 0x110000UL)
#define I2C1_BASE                           (APB1_PERIPH_BASE + 0x120000UL)
#define I2C2_BASE                           (APB1_PERIPH_BASE + 0x130000UL)
#define I2C7_BASE                           (APB1_PERIPH_BASE + 0x180000UL)
#define I3C1_BASE                           (APB1_PERIPH_BASE + 0x190000UL)
#define I3C2_BASE                           (APB1_PERIPH_BASE + 0x1A0000UL)
#define TIM10_BASE                          (APB1_PERIPH_BASE + 0x1C0000UL)
#define TIM11_BASE                          (APB1_PERIPH_BASE + 0x1D0000UL)

/*!< APB2 peripherals */
#define TIM1_BASE                           (APB2_PERIPH_BASE + 0x000000UL)
#define TIM8_BASE                           (APB2_PERIPH_BASE + 0x010000UL)
#define USART6_BASE                         (APB2_PERIPH_BASE + 0x020000UL)
#define SPI1_BASE                           (APB2_PERIPH_BASE + 0x030000UL)
#define SPI4_BASE                           (APB2_PERIPH_BASE + 0x040000UL)
#define TIM15_BASE                          (APB2_PERIPH_BASE + 0x050000UL)
#define TIM16_BASE                          (APB2_PERIPH_BASE + 0x060000UL)
#define TIM17_BASE                          (APB2_PERIPH_BASE + 0x070000UL)
#define SPI5_BASE                           (APB2_PERIPH_BASE + 0x080000UL)
#define SAI1_BASE                           (APB2_PERIPH_BASE + 0x090000UL)
#define SAI1_Block_A_BASE                   (SAI1_BASE + 0x004UL)
#define SAI1_Block_B_BASE                   (SAI1_BASE + 0x024UL)
#define SAI2_BASE                           (APB2_PERIPH_BASE + 0x0A0000UL)
#define SAI2_Block_A_BASE                   (SAI2_BASE + 0x004UL)
#define SAI2_Block_B_BASE                   (SAI2_BASE + 0x024UL)
#define SAI3_BASE                           (APB2_PERIPH_BASE + 0x0B0000UL)
#define SAI3_Block_A_BASE                   (SAI3_BASE + 0x004UL)
#define SAI3_Block_B_BASE                   (SAI3_BASE + 0x024UL)
#define FDCAN1_BASE                         (APB2_PERIPH_BASE + 0x0D0000UL)
#define FDCAN2_BASE                         (APB2_PERIPH_BASE + 0x0E0000UL)
#define CANCU_BASE                          (APB2_PERIPH_BASE + 0x100000UL)
#define CANSRAM_BASE                        (APB2_PERIPH_BASE + 0x110000UL)
#define USART1_BASE                         (APB2_PERIPH_BASE + 0x130000UL)
#define SAI4_BASE                           (APB2_PERIPH_BASE + 0x140000UL)
#define SAI4_Block_A_BASE                   (SAI4_BASE + 0x004UL)
#define SAI4_Block_B_BASE                   (SAI4_BASE + 0x024UL)
#define UART7_BASE                          (APB2_PERIPH_BASE + 0x170000UL)

/*!< AHB2 peripherals */
#define HPDMA1_BASE                         (AHB2_PERIPH_BASE + 0x000000UL)
#define HPDMA2_BASE                         (AHB2_PERIPH_BASE + 0x010000UL)
#define HPDMA3_BASE                         (AHB2_PERIPH_BASE + 0x020000UL)
#define OCTOSPI1_BASE                       (AHB2_PERIPH_BASE + 0x030000UL)
#define OCTOSPI2_BASE                       (AHB2_PERIPH_BASE + 0x040000UL)
#define IPCC1_BASE                          (AHB2_PERIPH_BASE + 0x090000UL)
#define IPCC1_C1_BASE                       (IPCC1_BASE)
#define IPCC1_C2_BASE                       (IPCC1_BASE + 0x10UL)
#define DCMI_BASE                           (AHB2_PERIPH_BASE + 0x0A0000UL)
#define PSSI_BASE                           (AHB2_PERIPH_BASE + 0x0B0000UL)
#define CRC_BASE                            (AHB2_PERIPH_BASE + 0x0C0000UL)
#define MDF1_BASE                           (AHB2_PERIPH_BASE + 0x0D0000UL)
#define MDF1_Filter0_BASE                   (MDF1_BASE + 0x80UL)
#define MDF1_Filter1_BASE                   (MDF1_BASE + 0x100UL)
#define MDF1_Filter2_BASE                   (MDF1_BASE + 0x180UL)
#define MDF1_Filter3_BASE                   (MDF1_BASE + 0x200UL)
#define MDF1_Filter4_BASE                   (MDF1_BASE + 0x280UL)
#define MDF1_Filter5_BASE                   (MDF1_BASE + 0x300UL)
#define MDF1_Filter6_BASE                   (MDF1_BASE + 0x380UL)
#define MDF1_Filter7_BASE                   (MDF1_BASE + 0x400UL)
#define ADC1_BASE                           (AHB2_PERIPH_BASE + 0x0E0000UL)
#define ADC2_BASE                           (AHB2_PERIPH_BASE + 0x0E0100UL)
#define ADC12_COMMON_BASE                   (AHB2_PERIPH_BASE + 0x0E0300UL)
#define ADC3_BASE                           (AHB2_PERIPH_BASE + 0x0F0000UL)
#define ADC3_COMMON_BASE                    (AHB2_PERIPH_BASE + 0x0F0300UL)
#define OCTOSPIM_BASE                       (AHB2_PERIPH_BASE + 0x100000UL)

#define HPDMA1_Channel0_BASE                (HPDMA1_BASE + 0x0050UL)
#define HPDMA1_Channel1_BASE                (HPDMA1_BASE + 0x00D0UL)
#define HPDMA1_Channel2_BASE                (HPDMA1_BASE + 0x0150UL)
#define HPDMA1_Channel3_BASE                (HPDMA1_BASE + 0x01D0UL)
#define HPDMA1_Channel4_BASE                (HPDMA1_BASE + 0x0250UL)
#define HPDMA1_Channel5_BASE                (HPDMA1_BASE + 0x02D0UL)
#define HPDMA1_Channel6_BASE                (HPDMA1_BASE + 0x0350UL)
#define HPDMA1_Channel7_BASE                (HPDMA1_BASE + 0x03D0UL)
#define HPDMA1_Channel8_BASE                (HPDMA1_BASE + 0x0450UL)
#define HPDMA1_Channel9_BASE                (HPDMA1_BASE + 0x04D0UL)
#define HPDMA1_Channel10_BASE               (HPDMA1_BASE + 0x0550UL)
#define HPDMA1_Channel11_BASE               (HPDMA1_BASE + 0x05D0UL)
#define HPDMA1_Channel12_BASE               (HPDMA1_BASE + 0x0650UL)
#define HPDMA1_Channel13_BASE               (HPDMA1_BASE + 0x06D0UL)
#define HPDMA1_Channel14_BASE               (HPDMA1_BASE + 0x0750UL)
#define HPDMA1_Channel15_BASE               (HPDMA1_BASE + 0x07D0UL)

