STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_ca35.h
/****************  Bit definition for IPCC_C2TOC1SR register  *****************/
#define IPCC_C2TOC1SR_CH1F_Pos        (0U)
#define IPCC_C2TOC1SR_CH1F_Msk        (0x1UL << IPCC_C2TOC1SR_CH1F_Pos)        /*!< 0x00000001 */
#define IPCC_C2TOC1SR_CH1F            IPCC_C2TOC1SR_CH1F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH2F_Pos        (1U)
#define IPCC_C2TOC1SR_CH2F_Msk        (0x1UL << IPCC_C2TOC1SR_CH2F_Pos)        /*!< 0x00000002 */
#define IPCC_C2TOC1SR_CH2F            IPCC_C2TOC1SR_CH2F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH3F_Pos        (2U)
#define IPCC_C2TOC1SR_CH3F_Msk        (0x1UL << IPCC_C2TOC1SR_CH3F_Pos)        /*!< 0x00000004 */
#define IPCC_C2TOC1SR_CH3F            IPCC_C2TOC1SR_CH3F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH4F_Pos        (3U)
#define IPCC_C2TOC1SR_CH4F_Msk        (0x1UL << IPCC_C2TOC1SR_CH4F_Pos)        /*!< 0x00000008 */
#define IPCC_C2TOC1SR_CH4F            IPCC_C2TOC1SR_CH4F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH5F_Pos        (4U)
#define IPCC_C2TOC1SR_CH5F_Msk        (0x1UL << IPCC_C2TOC1SR_CH5F_Pos)        /*!< 0x00000010 */
#define IPCC_C2TOC1SR_CH5F            IPCC_C2TOC1SR_CH5F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH6F_Pos        (5U)
#define IPCC_C2TOC1SR_CH6F_Msk        (0x1UL << IPCC_C2TOC1SR_CH6F_Pos)        /*!< 0x00000020 */
#define IPCC_C2TOC1SR_CH6F            IPCC_C2TOC1SR_CH6F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH7F_Pos        (6U)
#define IPCC_C2TOC1SR_CH7F_Msk        (0x1UL << IPCC_C2TOC1SR_CH7F_Pos)        /*!< 0x00000040 */
#define IPCC_C2TOC1SR_CH7F            IPCC_C2TOC1SR_CH7F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH8F_Pos        (7U)
#define IPCC_C2TOC1SR_CH8F_Msk        (0x1UL << IPCC_C2TOC1SR_CH8F_Pos)        /*!< 0x00000080 */
#define IPCC_C2TOC1SR_CH8F            IPCC_C2TOC1SR_CH8F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH9F_Pos        (8U)
#define IPCC_C2TOC1SR_CH9F_Msk        (0x1UL << IPCC_C2TOC1SR_CH9F_Pos)        /*!< 0x00000100 */
#define IPCC_C2TOC1SR_CH9F            IPCC_C2TOC1SR_CH9F_Msk                  /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH10F_Pos       (9U)
#define IPCC_C2TOC1SR_CH10F_Msk       (0x1UL << IPCC_C2TOC1SR_CH10F_Pos)       /*!< 0x00000200 */
#define IPCC_C2TOC1SR_CH10F           IPCC_C2TOC1SR_CH10F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH11F_Pos       (10U)
#define IPCC_C2TOC1SR_CH11F_Msk       (0x1UL << IPCC_C2TOC1SR_CH11F_Pos)       /*!< 0x00000400 */
#define IPCC_C2TOC1SR_CH11F           IPCC_C2TOC1SR_CH11F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH12F_Pos       (11U)
#define IPCC_C2TOC1SR_CH12F_Msk       (0x1UL << IPCC_C2TOC1SR_CH12F_Pos)       /*!< 0x00000800 */
#define IPCC_C2TOC1SR_CH12F           IPCC_C2TOC1SR_CH12F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH13F_Pos       (12U)
#define IPCC_C2TOC1SR_CH13F_Msk       (0x1UL << IPCC_C2TOC1SR_CH13F_Pos)       /*!< 0x00001000 */
#define IPCC_C2TOC1SR_CH13F           IPCC_C2TOC1SR_CH13F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH14F_Pos       (13U)
#define IPCC_C2TOC1SR_CH14F_Msk       (0x1UL << IPCC_C2TOC1SR_CH14F_Pos)       /*!< 0x00002000 */
#define IPCC_C2TOC1SR_CH14F           IPCC_C2TOC1SR_CH14F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH15F_Pos       (14U)
#define IPCC_C2TOC1SR_CH15F_Msk       (0x1UL << IPCC_C2TOC1SR_CH15F_Pos)       /*!< 0x00004000 */
#define IPCC_C2TOC1SR_CH15F           IPCC_C2TOC1SR_CH15F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */
#define IPCC_C2TOC1SR_CH16F_Pos       (15U)
#define IPCC_C2TOC1SR_CH16F_Msk       (0x1UL << IPCC_C2TOC1SR_CH16F_Pos)       /*!< 0x00008000 */
#define IPCC_C2TOC1SR_CH16F           IPCC_C2TOC1SR_CH16F_Msk                 /*!< Processor 2 transmit to processor 1 receive channel n status flag before masking */

/****************  Bit definition for IPCC_C1SECCFGR register  ****************/
#define IPCC_C1SECCFGR_CH1SEC_Pos     (0U)
#define IPCC_C1SECCFGR_CH1SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH1SEC_Pos)     /*!< 0x00000001 */
#define IPCC_C1SECCFGR_CH1SEC         IPCC_C1SECCFGR_CH1SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH2SEC_Pos     (1U)
#define IPCC_C1SECCFGR_CH2SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH2SEC_Pos)     /*!< 0x00000002 */
#define IPCC_C1SECCFGR_CH2SEC         IPCC_C1SECCFGR_CH2SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH3SEC_Pos     (2U)
#define IPCC_C1SECCFGR_CH3SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH3SEC_Pos)     /*!< 0x00000004 */
#define IPCC_C1SECCFGR_CH3SEC         IPCC_C1SECCFGR_CH3SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH4SEC_Pos     (3U)
#define IPCC_C1SECCFGR_CH4SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH4SEC_Pos)     /*!< 0x00000008 */
#define IPCC_C1SECCFGR_CH4SEC         IPCC_C1SECCFGR_CH4SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH5SEC_Pos     (4U)
#define IPCC_C1SECCFGR_CH5SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH5SEC_Pos)     /*!< 0x00000010 */
#define IPCC_C1SECCFGR_CH5SEC         IPCC_C1SECCFGR_CH5SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH6SEC_Pos     (5U)
#define IPCC_C1SECCFGR_CH6SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH6SEC_Pos)     /*!< 0x00000020 */
#define IPCC_C1SECCFGR_CH6SEC         IPCC_C1SECCFGR_CH6SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH7SEC_Pos     (6U)
#define IPCC_C1SECCFGR_CH7SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH7SEC_Pos)     /*!< 0x00000040 */
#define IPCC_C1SECCFGR_CH7SEC         IPCC_C1SECCFGR_CH7SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH8SEC_Pos     (7U)
#define IPCC_C1SECCFGR_CH8SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH8SEC_Pos)     /*!< 0x00000080 */
#define IPCC_C1SECCFGR_CH8SEC         IPCC_C1SECCFGR_CH8SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH9SEC_Pos     (8U)
#define IPCC_C1SECCFGR_CH9SEC_Msk     (0x1UL << IPCC_C1SECCFGR_CH9SEC_Pos)     /*!< 0x00000100 */
#define IPCC_C1SECCFGR_CH9SEC         IPCC_C1SECCFGR_CH9SEC_Msk               /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH10SEC_Pos    (9U)
#define IPCC_C1SECCFGR_CH10SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH10SEC_Pos)    /*!< 0x00000200 */
#define IPCC_C1SECCFGR_CH10SEC        IPCC_C1SECCFGR_CH10SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH11SEC_Pos    (10U)
#define IPCC_C1SECCFGR_CH11SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH11SEC_Pos)    /*!< 0x00000400 */
#define IPCC_C1SECCFGR_CH11SEC        IPCC_C1SECCFGR_CH11SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH12SEC_Pos    (11U)
#define IPCC_C1SECCFGR_CH12SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH12SEC_Pos)    /*!< 0x00000800 */
#define IPCC_C1SECCFGR_CH12SEC        IPCC_C1SECCFGR_CH12SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH13SEC_Pos    (12U)
#define IPCC_C1SECCFGR_CH13SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH13SEC_Pos)    /*!< 0x00001000 */
#define IPCC_C1SECCFGR_CH13SEC        IPCC_C1SECCFGR_CH13SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH14SEC_Pos    (13U)
#define IPCC_C1SECCFGR_CH14SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH14SEC_Pos)    /*!< 0x00002000 */
#define IPCC_C1SECCFGR_CH14SEC        IPCC_C1SECCFGR_CH14SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH15SEC_Pos    (14U)
#define IPCC_C1SECCFGR_CH15SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH15SEC_Pos)    /*!< 0x00004000 */
#define IPCC_C1SECCFGR_CH15SEC        IPCC_C1SECCFGR_CH15SEC_Msk              /*!< processor 1 channel n security enable */
#define IPCC_C1SECCFGR_CH16SEC_Pos    (15U)
#define IPCC_C1SECCFGR_CH16SEC_Msk    (0x1UL << IPCC_C1SECCFGR_CH16SEC_Pos)    /*!< 0x00008000 */
#define IPCC_C1SECCFGR_CH16SEC        IPCC_C1SECCFGR_CH16SEC_Msk              /*!< processor 1 channel n security enable */

/***************  Bit definition for IPCC_C1PRIVCFGR register  ****************/
#define IPCC_C1PRIVCFGR_CH1PRIV_Pos   (0U)
#define IPCC_C1PRIVCFGR_CH1PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH1PRIV_Pos)   /*!< 0x00000001 */
#define IPCC_C1PRIVCFGR_CH1PRIV       IPCC_C1PRIVCFGR_CH1PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH2PRIV_Pos   (1U)
#define IPCC_C1PRIVCFGR_CH2PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH2PRIV_Pos)   /*!< 0x00000002 */
#define IPCC_C1PRIVCFGR_CH2PRIV       IPCC_C1PRIVCFGR_CH2PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH3PRIV_Pos   (2U)
#define IPCC_C1PRIVCFGR_CH3PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH3PRIV_Pos)   /*!< 0x00000004 */
#define IPCC_C1PRIVCFGR_CH3PRIV       IPCC_C1PRIVCFGR_CH3PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH4PRIV_Pos   (3U)
#define IPCC_C1PRIVCFGR_CH4PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH4PRIV_Pos)   /*!< 0x00000008 */
#define IPCC_C1PRIVCFGR_CH4PRIV       IPCC_C1PRIVCFGR_CH4PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH5PRIV_Pos   (4U)
#define IPCC_C1PRIVCFGR_CH5PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH5PRIV_Pos)   /*!< 0x00000010 */
#define IPCC_C1PRIVCFGR_CH5PRIV       IPCC_C1PRIVCFGR_CH5PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH6PRIV_Pos   (5U)
#define IPCC_C1PRIVCFGR_CH6PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH6PRIV_Pos)   /*!< 0x00000020 */
#define IPCC_C1PRIVCFGR_CH6PRIV       IPCC_C1PRIVCFGR_CH6PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH7PRIV_Pos   (6U)
#define IPCC_C1PRIVCFGR_CH7PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH7PRIV_Pos)   /*!< 0x00000040 */
#define IPCC_C1PRIVCFGR_CH7PRIV       IPCC_C1PRIVCFGR_CH7PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH8PRIV_Pos   (7U)
#define IPCC_C1PRIVCFGR_CH8PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH8PRIV_Pos)   /*!< 0x00000080 */
#define IPCC_C1PRIVCFGR_CH8PRIV       IPCC_C1PRIVCFGR_CH8PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH9PRIV_Pos   (8U)
#define IPCC_C1PRIVCFGR_CH9PRIV_Msk   (0x1UL << IPCC_C1PRIVCFGR_CH9PRIV_Pos)   /*!< 0x00000100 */
#define IPCC_C1PRIVCFGR_CH9PRIV       IPCC_C1PRIVCFGR_CH9PRIV_Msk             /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH10PRIV_Pos  (9U)
#define IPCC_C1PRIVCFGR_CH10PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH10PRIV_Pos)  /*!< 0x00000200 */
#define IPCC_C1PRIVCFGR_CH10PRIV      IPCC_C1PRIVCFGR_CH10PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH11PRIV_Pos  (10U)
#define IPCC_C1PRIVCFGR_CH11PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH11PRIV_Pos)  /*!< 0x00000400 */
#define IPCC_C1PRIVCFGR_CH11PRIV      IPCC_C1PRIVCFGR_CH11PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH12PRIV_Pos  (11U)
#define IPCC_C1PRIVCFGR_CH12PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH12PRIV_Pos)  /*!< 0x00000800 */
#define IPCC_C1PRIVCFGR_CH12PRIV      IPCC_C1PRIVCFGR_CH12PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH13PRIV_Pos  (12U)
#define IPCC_C1PRIVCFGR_CH13PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH13PRIV_Pos)  /*!< 0x00001000 */
#define IPCC_C1PRIVCFGR_CH13PRIV      IPCC_C1PRIVCFGR_CH13PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH14PRIV_Pos  (13U)
#define IPCC_C1PRIVCFGR_CH14PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH14PRIV_Pos)  /*!< 0x00002000 */
#define IPCC_C1PRIVCFGR_CH14PRIV      IPCC_C1PRIVCFGR_CH14PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH15PRIV_Pos  (14U)
#define IPCC_C1PRIVCFGR_CH15PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH15PRIV_Pos)  /*!< 0x00004000 */
#define IPCC_C1PRIVCFGR_CH15PRIV      IPCC_C1PRIVCFGR_CH15PRIV_Msk            /*!< processor 1 channel n privilege enable */
#define IPCC_C1PRIVCFGR_CH16PRIV_Pos  (15U)
#define IPCC_C1PRIVCFGR_CH16PRIV_Msk  (0x1UL << IPCC_C1PRIVCFGR_CH16PRIV_Pos)  /*!< 0x00008000 */
#define IPCC_C1PRIVCFGR_CH16PRIV      IPCC_C1PRIVCFGR_CH16PRIV_Msk            /*!< processor 1 channel n privilege enable */

/****************  Bit definition for IPCC_C1CIDCFGR register  ****************/
#define IPCC_C1CIDCFGR_CFEN_Pos       (0U)
#define IPCC_C1CIDCFGR_CFEN_Msk       (0x1UL << IPCC_C1CIDCFGR_CFEN_Pos)       /*!< 0x00000001 */
#define IPCC_C1CIDCFGR_CFEN           IPCC_C1CIDCFGR_CFEN_Msk                 /*!< CID filtering enabled for processor 1 */
#define IPCC_C1CIDCFGR_CID_Pos        (4U)
#define IPCC_C1CIDCFGR_CID_Msk        (0xFUL << IPCC_C1CIDCFGR_CID_Pos)        /*!< 0x000000F0 */
#define IPCC_C1CIDCFGR_CID            IPCC_C1CIDCFGR_CID_Msk                  /*!< processor 1 CID domain identification */

/****************  Bit definition for IPCC_C2SECCFGR register  ****************/
#define IPCC_C2SECCFGR_CH1SEC_Pos     (0U)
#define IPCC_C2SECCFGR_CH1SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH1SEC_Pos)     /*!< 0x00000001 */
#define IPCC_C2SECCFGR_CH1SEC         IPCC_C2SECCFGR_CH1SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH2SEC_Pos     (1U)
#define IPCC_C2SECCFGR_CH2SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH2SEC_Pos)     /*!< 0x00000002 */
#define IPCC_C2SECCFGR_CH2SEC         IPCC_C2SECCFGR_CH2SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH3SEC_Pos     (2U)
#define IPCC_C2SECCFGR_CH3SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH3SEC_Pos)     /*!< 0x00000004 */
#define IPCC_C2SECCFGR_CH3SEC         IPCC_C2SECCFGR_CH3SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH4SEC_Pos     (3U)
#define IPCC_C2SECCFGR_CH4SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH4SEC_Pos)     /*!< 0x00000008 */
#define IPCC_C2SECCFGR_CH4SEC         IPCC_C2SECCFGR_CH4SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH5SEC_Pos     (4U)
#define IPCC_C2SECCFGR_CH5SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH5SEC_Pos)     /*!< 0x00000010 */
#define IPCC_C2SECCFGR_CH5SEC         IPCC_C2SECCFGR_CH5SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH6SEC_Pos     (5U)
#define IPCC_C2SECCFGR_CH6SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH6SEC_Pos)     /*!< 0x00000020 */
#define IPCC_C2SECCFGR_CH6SEC         IPCC_C2SECCFGR_CH6SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH7SEC_Pos     (6U)
#define IPCC_C2SECCFGR_CH7SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH7SEC_Pos)     /*!< 0x00000040 */
#define IPCC_C2SECCFGR_CH7SEC         IPCC_C2SECCFGR_CH7SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH8SEC_Pos     (7U)
#define IPCC_C2SECCFGR_CH8SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH8SEC_Pos)     /*!< 0x00000080 */
#define IPCC_C2SECCFGR_CH8SEC         IPCC_C2SECCFGR_CH8SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH9SEC_Pos     (8U)
#define IPCC_C2SECCFGR_CH9SEC_Msk     (0x1UL << IPCC_C2SECCFGR_CH9SEC_Pos)     /*!< 0x00000100 */
#define IPCC_C2SECCFGR_CH9SEC         IPCC_C2SECCFGR_CH9SEC_Msk               /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH10SEC_Pos    (9U)
#define IPCC_C2SECCFGR_CH10SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH10SEC_Pos)    /*!< 0x00000200 */
#define IPCC_C2SECCFGR_CH10SEC        IPCC_C2SECCFGR_CH10SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH11SEC_Pos    (10U)
#define IPCC_C2SECCFGR_CH11SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH11SEC_Pos)    /*!< 0x00000400 */
#define IPCC_C2SECCFGR_CH11SEC        IPCC_C2SECCFGR_CH11SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH12SEC_Pos    (11U)
#define IPCC_C2SECCFGR_CH12SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH12SEC_Pos)    /*!< 0x00000800 */
#define IPCC_C2SECCFGR_CH12SEC        IPCC_C2SECCFGR_CH12SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH13SEC_Pos    (12U)
#define IPCC_C2SECCFGR_CH13SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH13SEC_Pos)    /*!< 0x00001000 */
#define IPCC_C2SECCFGR_CH13SEC        IPCC_C2SECCFGR_CH13SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH14SEC_Pos    (13U)
#define IPCC_C2SECCFGR_CH14SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH14SEC_Pos)    /*!< 0x00002000 */
#define IPCC_C2SECCFGR_CH14SEC        IPCC_C2SECCFGR_CH14SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH15SEC_Pos    (14U)
#define IPCC_C2SECCFGR_CH15SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH15SEC_Pos)    /*!< 0x00004000 */
#define IPCC_C2SECCFGR_CH15SEC        IPCC_C2SECCFGR_CH15SEC_Msk              /*!< processor 2 channel n security enable */
#define IPCC_C2SECCFGR_CH16SEC_Pos    (15U)
#define IPCC_C2SECCFGR_CH16SEC_Msk    (0x1UL << IPCC_C2SECCFGR_CH16SEC_Pos)    /*!< 0x00008000 */
#define IPCC_C2SECCFGR_CH16SEC        IPCC_C2SECCFGR_CH16SEC_Msk              /*!< processor 2 channel n security enable */

/***************  Bit definition for IPCC_C2PRIVCFGR register  ****************/
#define IPCC_C2PRIVCFGR_CH1PRIV_Pos   (0U)
#define IPCC_C2PRIVCFGR_CH1PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH1PRIV_Pos)   /*!< 0x00000001 */
#define IPCC_C2PRIVCFGR_CH1PRIV       IPCC_C2PRIVCFGR_CH1PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH2PRIV_Pos   (1U)
#define IPCC_C2PRIVCFGR_CH2PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH2PRIV_Pos)   /*!< 0x00000002 */
#define IPCC_C2PRIVCFGR_CH2PRIV       IPCC_C2PRIVCFGR_CH2PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH3PRIV_Pos   (2U)
#define IPCC_C2PRIVCFGR_CH3PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH3PRIV_Pos)   /*!< 0x00000004 */
#define IPCC_C2PRIVCFGR_CH3PRIV       IPCC_C2PRIVCFGR_CH3PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH4PRIV_Pos   (3U)
#define IPCC_C2PRIVCFGR_CH4PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH4PRIV_Pos)   /*!< 0x00000008 */
#define IPCC_C2PRIVCFGR_CH4PRIV       IPCC_C2PRIVCFGR_CH4PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH5PRIV_Pos   (4U)
#define IPCC_C2PRIVCFGR_CH5PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH5PRIV_Pos)   /*!< 0x00000010 */
#define IPCC_C2PRIVCFGR_CH5PRIV       IPCC_C2PRIVCFGR_CH5PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH6PRIV_Pos   (5U)
#define IPCC_C2PRIVCFGR_CH6PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH6PRIV_Pos)   /*!< 0x00000020 */
#define IPCC_C2PRIVCFGR_CH6PRIV       IPCC_C2PRIVCFGR_CH6PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH7PRIV_Pos   (6U)
#define IPCC_C2PRIVCFGR_CH7PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH7PRIV_Pos)   /*!< 0x00000040 */
#define IPCC_C2PRIVCFGR_CH7PRIV       IPCC_C2PRIVCFGR_CH7PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH8PRIV_Pos   (7U)
#define IPCC_C2PRIVCFGR_CH8PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH8PRIV_Pos)   /*!< 0x00000080 */
#define IPCC_C2PRIVCFGR_CH8PRIV       IPCC_C2PRIVCFGR_CH8PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH9PRIV_Pos   (8U)
#define IPCC_C2PRIVCFGR_CH9PRIV_Msk   (0x1UL << IPCC_C2PRIVCFGR_CH9PRIV_Pos)   /*!< 0x00000100 */
#define IPCC_C2PRIVCFGR_CH9PRIV       IPCC_C2PRIVCFGR_CH9PRIV_Msk             /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH10PRIV_Pos  (9U)
#define IPCC_C2PRIVCFGR_CH10PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH10PRIV_Pos)  /*!< 0x00000200 */
#define IPCC_C2PRIVCFGR_CH10PRIV      IPCC_C2PRIVCFGR_CH10PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH11PRIV_Pos  (10U)
#define IPCC_C2PRIVCFGR_CH11PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH11PRIV_Pos)  /*!< 0x00000400 */
#define IPCC_C2PRIVCFGR_CH11PRIV      IPCC_C2PRIVCFGR_CH11PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH12PRIV_Pos  (11U)
#define IPCC_C2PRIVCFGR_CH12PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH12PRIV_Pos)  /*!< 0x00000800 */
#define IPCC_C2PRIVCFGR_CH12PRIV      IPCC_C2PRIVCFGR_CH12PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH13PRIV_Pos  (12U)
#define IPCC_C2PRIVCFGR_CH13PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH13PRIV_Pos)  /*!< 0x00001000 */
#define IPCC_C2PRIVCFGR_CH13PRIV      IPCC_C2PRIVCFGR_CH13PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH14PRIV_Pos  (13U)
#define IPCC_C2PRIVCFGR_CH14PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH14PRIV_Pos)  /*!< 0x00002000 */
#define IPCC_C2PRIVCFGR_CH14PRIV      IPCC_C2PRIVCFGR_CH14PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH15PRIV_Pos  (14U)
#define IPCC_C2PRIVCFGR_CH15PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH15PRIV_Pos)  /*!< 0x00004000 */
#define IPCC_C2PRIVCFGR_CH15PRIV      IPCC_C2PRIVCFGR_CH15PRIV_Msk            /*!< processor 2 channel n privilege enable */
#define IPCC_C2PRIVCFGR_CH16PRIV_Pos  (15U)
#define IPCC_C2PRIVCFGR_CH16PRIV_Msk  (0x1UL << IPCC_C2PRIVCFGR_CH16PRIV_Pos)  /*!< 0x00008000 */
#define IPCC_C2PRIVCFGR_CH16PRIV      IPCC_C2PRIVCFGR_CH16PRIV_Msk            /*!< processor 2 channel n privilege enable */

/****************  Bit definition for IPCC_C2CIDCFGR register  ****************/
#define IPCC_C2CIDCFGR_CFEN_Pos       (0U)
#define IPCC_C2CIDCFGR_CFEN_Msk       (0x1UL << IPCC_C2CIDCFGR_CFEN_Pos)       /*!< 0x00000001 */
#define IPCC_C2CIDCFGR_CFEN           IPCC_C2CIDCFGR_CFEN_Msk                 /*!< CID filtering enabled for processor 2 */
#define IPCC_C2CIDCFGR_CID_Pos        (4U)
#define IPCC_C2CIDCFGR_CID_Msk        (0xFUL << IPCC_C2CIDCFGR_CID_Pos)        /*!< 0x000000F0 */
#define IPCC_C2CIDCFGR_CID            IPCC_C2CIDCFGR_CID_Msk                  /*!< processor 2 CID domain identification */

