STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_ca35.h
/******************  Bit definition for SERC_IER2 register  *******************/
#define SERC_IER2_PDRIE64_Pos         (0U)
#define SERC_IER2_PDRIE64_Msk         (0x1UL << SERC_IER2_PDRIE64_Pos)    /*!< 0x00000001 */
#define SERC_IER2_PDRIE64             SERC_IER2_PDRIE64_Msk
#define SERC_IER2_PDRIE65_Pos         (1U)
#define SERC_IER2_PDRIE65_Msk         (0x1UL << SERC_IER2_PDRIE65_Pos)    /*!< 0x00000002 */
#define SERC_IER2_PDRIE65             SERC_IER2_PDRIE65_Msk
#define SERC_IER2_PDRIE66_Pos         (2U)
#define SERC_IER2_PDRIE66_Msk         (0x1UL << SERC_IER2_PDRIE66_Pos)    /*!< 0x00000004 */
#define SERC_IER2_PDRIE66             SERC_IER2_PDRIE66_Msk
#define SERC_IER2_PDRIE67_Pos         (3U)
#define SERC_IER2_PDRIE67_Msk         (0x1UL << SERC_IER2_PDRIE67_Pos)    /*!< 0x00000008 */
#define SERC_IER2_PDRIE67             SERC_IER2_PDRIE67_Msk
#define SERC_IER2_PDRIE68_Pos         (4U)
#define SERC_IER2_PDRIE68_Msk         (0x1UL << SERC_IER2_PDRIE68_Pos)    /*!< 0x00000010 */
#define SERC_IER2_PDRIE68             SERC_IER2_PDRIE68_Msk
#define SERC_IER2_PDRIE69_Pos         (5U)
#define SERC_IER2_PDRIE69_Msk         (0x1UL << SERC_IER2_PDRIE69_Pos)    /*!< 0x00000020 */
#define SERC_IER2_PDRIE69             SERC_IER2_PDRIE69_Msk
#define SERC_IER2_PDRIE70_Pos         (6U)
#define SERC_IER2_PDRIE70_Msk         (0x1UL << SERC_IER2_PDRIE70_Pos)    /*!< 0x00000040 */
#define SERC_IER2_PDRIE70             SERC_IER2_PDRIE70_Msk
#define SERC_IER2_PDRIE71_Pos         (7U)
#define SERC_IER2_PDRIE71_Msk         (0x1UL << SERC_IER2_PDRIE71_Pos)    /*!< 0x00000080 */
#define SERC_IER2_PDRIE71             SERC_IER2_PDRIE71_Msk
#define SERC_IER2_PDRIE72_Pos         (8U)
#define SERC_IER2_PDRIE72_Msk         (0x1UL << SERC_IER2_PDRIE72_Pos)    /*!< 0x00000100 */
#define SERC_IER2_PDRIE72             SERC_IER2_PDRIE72_Msk
#define SERC_IER2_PDRIE73_Pos         (9U)
#define SERC_IER2_PDRIE73_Msk         (0x1UL << SERC_IER2_PDRIE73_Pos)    /*!< 0x00000200 */
#define SERC_IER2_PDRIE73             SERC_IER2_PDRIE73_Msk
#define SERC_IER2_PDRIE74_Pos         (10U)
#define SERC_IER2_PDRIE74_Msk         (0x1UL << SERC_IER2_PDRIE74_Pos)    /*!< 0x00000400 */
#define SERC_IER2_PDRIE74             SERC_IER2_PDRIE74_Msk
#define SERC_IER2_PDRIE75_Pos         (11U)
#define SERC_IER2_PDRIE75_Msk         (0x1UL << SERC_IER2_PDRIE75_Pos)    /*!< 0x00000800 */
#define SERC_IER2_PDRIE75             SERC_IER2_PDRIE75_Msk
#define SERC_IER2_PDRIE76_Pos         (12U)
#define SERC_IER2_PDRIE76_Msk         (0x1UL << SERC_IER2_PDRIE76_Pos)    /*!< 0x00001000 */
#define SERC_IER2_PDRIE76             SERC_IER2_PDRIE76_Msk
#define SERC_IER2_PDRIE77_Pos         (13U)
#define SERC_IER2_PDRIE77_Msk         (0x1UL << SERC_IER2_PDRIE77_Pos)    /*!< 0x00002000 */
#define SERC_IER2_PDRIE77             SERC_IER2_PDRIE77_Msk
#define SERC_IER2_PDRIE78_Pos         (14U)
#define SERC_IER2_PDRIE78_Msk         (0x1UL << SERC_IER2_PDRIE78_Pos)    /*!< 0x00004000 */
#define SERC_IER2_PDRIE78             SERC_IER2_PDRIE78_Msk
#define SERC_IER2_PDRIE79_Pos         (15U)
#define SERC_IER2_PDRIE79_Msk         (0x1UL << SERC_IER2_PDRIE79_Pos)    /*!< 0x00008000 */
#define SERC_IER2_PDRIE79             SERC_IER2_PDRIE79_Msk
#define SERC_IER2_PDRIE80_Pos         (16U)
#define SERC_IER2_PDRIE80_Msk         (0x1UL << SERC_IER2_PDRIE80_Pos)    /*!< 0x00010000 */
#define SERC_IER2_PDRIE80             SERC_IER2_PDRIE80_Msk
#define SERC_IER2_PDRIE81_Pos         (17U)
#define SERC_IER2_PDRIE81_Msk         (0x1UL << SERC_IER2_PDRIE81_Pos)    /*!< 0x00020000 */
#define SERC_IER2_PDRIE81             SERC_IER2_PDRIE81_Msk
#define SERC_IER2_PDRIE82_Pos         (18U)
#define SERC_IER2_PDRIE82_Msk         (0x1UL << SERC_IER2_PDRIE82_Pos)    /*!< 0x00040000 */
#define SERC_IER2_PDRIE82             SERC_IER2_PDRIE82_Msk
#define SERC_IER2_PDRIE83_Pos         (19U)
#define SERC_IER2_PDRIE83_Msk         (0x1UL << SERC_IER2_PDRIE83_Pos)    /*!< 0x00080000 */
#define SERC_IER2_PDRIE83             SERC_IER2_PDRIE83_Msk
#define SERC_IER2_PDRIE84_Pos         (20U)
#define SERC_IER2_PDRIE84_Msk         (0x1UL << SERC_IER2_PDRIE84_Pos)    /*!< 0x00100000 */
#define SERC_IER2_PDRIE84             SERC_IER2_PDRIE84_Msk
#define SERC_IER2_PDRIE85_Pos         (21U)
#define SERC_IER2_PDRIE85_Msk         (0x1UL << SERC_IER2_PDRIE85_Pos)    /*!< 0x00200000 */
#define SERC_IER2_PDRIE85             SERC_IER2_PDRIE85_Msk
#define SERC_IER2_PDRIE86_Pos         (22U)
#define SERC_IER2_PDRIE86_Msk         (0x1UL << SERC_IER2_PDRIE86_Pos)    /*!< 0x00400000 */
#define SERC_IER2_PDRIE86             SERC_IER2_PDRIE86_Msk
#define SERC_IER2_PDRIE87_Pos         (23U)
#define SERC_IER2_PDRIE87_Msk         (0x1UL << SERC_IER2_PDRIE87_Pos)    /*!< 0x00800000 */
#define SERC_IER2_PDRIE87             SERC_IER2_PDRIE87_Msk
#define SERC_IER2_PDRIE88_Pos         (24U)
#define SERC_IER2_PDRIE88_Msk         (0x1UL << SERC_IER2_PDRIE88_Pos)    /*!< 0x01000000 */
#define SERC_IER2_PDRIE88             SERC_IER2_PDRIE88_Msk
#define SERC_IER2_PDRIE89_Pos         (25U)
#define SERC_IER2_PDRIE89_Msk         (0x1UL << SERC_IER2_PDRIE89_Pos)    /*!< 0x02000000 */
#define SERC_IER2_PDRIE89             SERC_IER2_PDRIE89_Msk
#define SERC_IER2_PDRIE90_Pos         (26U)
#define SERC_IER2_PDRIE90_Msk         (0x1UL << SERC_IER2_PDRIE90_Pos)    /*!< 0x04000000 */
#define SERC_IER2_PDRIE90             SERC_IER2_PDRIE90_Msk
#define SERC_IER2_PDRIE91_Pos         (27U)
#define SERC_IER2_PDRIE91_Msk         (0x1UL << SERC_IER2_PDRIE91_Pos)    /*!< 0x08000000 */
#define SERC_IER2_PDRIE91             SERC_IER2_PDRIE91_Msk
#define SERC_IER2_PDRIE92_Pos         (28U)
#define SERC_IER2_PDRIE92_Msk         (0x1UL << SERC_IER2_PDRIE92_Pos)    /*!< 0x10000000 */
#define SERC_IER2_PDRIE92             SERC_IER2_PDRIE92_Msk
#define SERC_IER2_PDRIE93_Pos         (29U)
#define SERC_IER2_PDRIE93_Msk         (0x1UL << SERC_IER2_PDRIE93_Pos)    /*!< 0x20000000 */
#define SERC_IER2_PDRIE93             SERC_IER2_PDRIE93_Msk
#define SERC_IER2_PDRIE94_Pos         (30U)
#define SERC_IER2_PDRIE94_Msk         (0x1UL << SERC_IER2_PDRIE94_Pos)    /*!< 0x40000000 */
#define SERC_IER2_PDRIE94             SERC_IER2_PDRIE94_Msk
#define SERC_IER2_PDRIE95_Pos         (31U)
#define SERC_IER2_PDRIE95_Msk         (0x1UL << SERC_IER2_PDRIE95_Pos)    /*!< 0x80000000 */
#define SERC_IER2_PDRIE95             SERC_IER2_PDRIE95_Msk

/******************  Bit definition for SERC_IER3 register  *******************/
#define SERC_IER3_PDRIE96_Pos         (0U)
#define SERC_IER3_PDRIE96_Msk         (0x1UL << SERC_IER3_PDRIE96_Pos)    /*!< 0x00000001 */
#define SERC_IER3_PDRIE96             SERC_IER3_PDRIE96_Msk
#define SERC_IER3_PDRIE97_Pos         (1U)
#define SERC_IER3_PDRIE97_Msk         (0x1UL << SERC_IER3_PDRIE97_Pos)    /*!< 0x00000002 */
#define SERC_IER3_PDRIE97             SERC_IER3_PDRIE97_Msk
#define SERC_IER3_PDRIE98_Pos         (2U)
#define SERC_IER3_PDRIE98_Msk         (0x1UL << SERC_IER3_PDRIE98_Pos)    /*!< 0x00000004 */
#define SERC_IER3_PDRIE98             SERC_IER3_PDRIE98_Msk
#define SERC_IER3_PDRIE99_Pos         (3U)
#define SERC_IER3_PDRIE99_Msk         (0x1UL << SERC_IER3_PDRIE99_Pos)    /*!< 0x00000008 */
#define SERC_IER3_PDRIE99             SERC_IER3_PDRIE99_Msk
#define SERC_IER3_PDRIE100_Pos        (4U)
#define SERC_IER3_PDRIE100_Msk        (0x1UL << SERC_IER3_PDRIE100_Pos)   /*!< 0x00000010 */
#define SERC_IER3_PDRIE100            SERC_IER3_PDRIE100_Msk
#define SERC_IER3_PDRIE101_Pos        (5U)
#define SERC_IER3_PDRIE101_Msk        (0x1UL << SERC_IER3_PDRIE101_Pos)   /*!< 0x00000020 */
#define SERC_IER3_PDRIE101            SERC_IER3_PDRIE101_Msk
#define SERC_IER3_PDRIE102_Pos        (6U)
#define SERC_IER3_PDRIE102_Msk        (0x1UL << SERC_IER3_PDRIE102_Pos)   /*!< 0x00000040 */
#define SERC_IER3_PDRIE102            SERC_IER3_PDRIE102_Msk
#define SERC_IER3_PDRIE103_Pos        (7U)
#define SERC_IER3_PDRIE103_Msk        (0x1UL << SERC_IER3_PDRIE103_Pos)   /*!< 0x00000080 */
#define SERC_IER3_PDRIE103            SERC_IER3_PDRIE103_Msk
#define SERC_IER3_PDRIE104_Pos        (8U)
#define SERC_IER3_PDRIE104_Msk        (0x1UL << SERC_IER3_PDRIE104_Pos)   /*!< 0x00000100 */
#define SERC_IER3_PDRIE104            SERC_IER3_PDRIE104_Msk
#define SERC_IER3_PDRIE105_Pos        (9U)
#define SERC_IER3_PDRIE105_Msk        (0x1UL << SERC_IER3_PDRIE105_Pos)   /*!< 0x00000200 */
#define SERC_IER3_PDRIE105            SERC_IER3_PDRIE105_Msk
#define SERC_IER3_PDRIE106_Pos        (10U)
#define SERC_IER3_PDRIE106_Msk        (0x1UL << SERC_IER3_PDRIE106_Pos)   /*!< 0x00000400 */
#define SERC_IER3_PDRIE106            SERC_IER3_PDRIE106_Msk
#define SERC_IER3_PDRIE107_Pos        (11U)
#define SERC_IER3_PDRIE107_Msk        (0x1UL << SERC_IER3_PDRIE107_Pos)   /*!< 0x00000800 */
#define SERC_IER3_PDRIE107            SERC_IER3_PDRIE107_Msk
#define SERC_IER3_PDRIE108_Pos        (12U)
#define SERC_IER3_PDRIE108_Msk        (0x1UL << SERC_IER3_PDRIE108_Pos)   /*!< 0x00001000 */
#define SERC_IER3_PDRIE108            SERC_IER3_PDRIE108_Msk
#define SERC_IER3_PDRIE109_Pos        (13U)
#define SERC_IER3_PDRIE109_Msk        (0x1UL << SERC_IER3_PDRIE109_Pos)   /*!< 0x00002000 */
#define SERC_IER3_PDRIE109            SERC_IER3_PDRIE109_Msk
#define SERC_IER3_PDRIE110_Pos        (14U)
#define SERC_IER3_PDRIE110_Msk        (0x1UL << SERC_IER3_PDRIE110_Pos)   /*!< 0x00004000 */
#define SERC_IER3_PDRIE110            SERC_IER3_PDRIE110_Msk
#define SERC_IER3_PDRIE111_Pos        (15U)
#define SERC_IER3_PDRIE111_Msk        (0x1UL << SERC_IER3_PDRIE111_Pos)   /*!< 0x00008000 */
#define SERC_IER3_PDRIE111            SERC_IER3_PDRIE111_Msk
#define SERC_IER3_PDRIE112_Pos        (16U)
#define SERC_IER3_PDRIE112_Msk        (0x1UL << SERC_IER3_PDRIE112_Pos)   /*!< 0x00010000 */
#define SERC_IER3_PDRIE112            SERC_IER3_PDRIE112_Msk
#define SERC_IER3_PDRIE113_Pos        (17U)
#define SERC_IER3_PDRIE113_Msk        (0x1UL << SERC_IER3_PDRIE113_Pos)   /*!< 0x00020000 */
#define SERC_IER3_PDRIE113            SERC_IER3_PDRIE113_Msk
#define SERC_IER3_PDRIE114_Pos        (18U)
#define SERC_IER3_PDRIE114_Msk        (0x1UL << SERC_IER3_PDRIE114_Pos)   /*!< 0x00040000 */
#define SERC_IER3_PDRIE114            SERC_IER3_PDRIE114_Msk
#define SERC_IER3_PDRIE115_Pos        (19U)
#define SERC_IER3_PDRIE115_Msk        (0x1UL << SERC_IER3_PDRIE115_Pos)   /*!< 0x00080000 */
#define SERC_IER3_PDRIE115            SERC_IER3_PDRIE115_Msk
#define SERC_IER3_PDRIE116_Pos        (20U)
#define SERC_IER3_PDRIE116_Msk        (0x1UL << SERC_IER3_PDRIE116_Pos)   /*!< 0x00100000 */
#define SERC_IER3_PDRIE116            SERC_IER3_PDRIE116_Msk
#define SERC_IER3_PDRIE117_Pos        (21U)
#define SERC_IER3_PDRIE117_Msk        (0x1UL << SERC_IER3_PDRIE117_Pos)   /*!< 0x00200000 */
#define SERC_IER3_PDRIE117            SERC_IER3_PDRIE117_Msk
#define SERC_IER3_PDRIE118_Pos        (22U)
#define SERC_IER3_PDRIE118_Msk        (0x1UL << SERC_IER3_PDRIE118_Pos)   /*!< 0x00400000 */
#define SERC_IER3_PDRIE118            SERC_IER3_PDRIE118_Msk
#define SERC_IER3_PDRIE119_Pos        (23U)
#define SERC_IER3_PDRIE119_Msk        (0x1UL << SERC_IER3_PDRIE119_Pos)   /*!< 0x00800000 */
#define SERC_IER3_PDRIE119            SERC_IER3_PDRIE119_Msk
#define SERC_IER3_PDRIE120_Pos        (24U)
#define SERC_IER3_PDRIE120_Msk        (0x1UL << SERC_IER3_PDRIE120_Pos)   /*!< 0x01000000 */
#define SERC_IER3_PDRIE120            SERC_IER3_PDRIE120_Msk
#define SERC_IER3_PDRIE121_Pos        (25U)
#define SERC_IER3_PDRIE121_Msk        (0x1UL << SERC_IER3_PDRIE121_Pos)   /*!< 0x02000000 */
#define SERC_IER3_PDRIE121            SERC_IER3_PDRIE121_Msk
#define SERC_IER3_PDRIE122_Pos        (26U)
#define SERC_IER3_PDRIE122_Msk        (0x1UL << SERC_IER3_PDRIE122_Pos)   /*!< 0x04000000 */
#define SERC_IER3_PDRIE122            SERC_IER3_PDRIE122_Msk
#define SERC_IER3_PDRIE123_Pos        (27U)
#define SERC_IER3_PDRIE123_Msk        (0x1UL << SERC_IER3_PDRIE123_Pos)   /*!< 0x08000000 */
#define SERC_IER3_PDRIE123            SERC_IER3_PDRIE123_Msk
#define SERC_IER3_PDRIE124_Pos        (28U)
#define SERC_IER3_PDRIE124_Msk        (0x1UL << SERC_IER3_PDRIE124_Pos)   /*!< 0x10000000 */
#define SERC_IER3_PDRIE124            SERC_IER3_PDRIE124_Msk
#define SERC_IER3_PDRIE125_Pos        (29U)
#define SERC_IER3_PDRIE125_Msk        (0x1UL << SERC_IER3_PDRIE125_Pos)   /*!< 0x20000000 */
#define SERC_IER3_PDRIE125            SERC_IER3_PDRIE125_Msk
#define SERC_IER3_PDRIE126_Pos        (30U)
#define SERC_IER3_PDRIE126_Msk        (0x1UL << SERC_IER3_PDRIE126_Pos)   /*!< 0x40000000 */
#define SERC_IER3_PDRIE126            SERC_IER3_PDRIE126_Msk
#define SERC_IER3_PDRIE127_Pos        (31U)
#define SERC_IER3_PDRIE127_Msk        (0x1UL << SERC_IER3_PDRIE127_Pos)   /*!< 0x80000000 */
#define SERC_IER3_PDRIE127            SERC_IER3_PDRIE127_Msk

/******************  Bit definition for SERC_IER4 register  *******************/
#define SERC_IER4_PDRIE128_Pos        (0U)
#define SERC_IER4_PDRIE128_Msk        (0x1UL << SERC_IER4_PDRIE128_Pos)   /*!< 0x00000001 */
#define SERC_IER4_PDRIE128            SERC_IER4_PDRIE128_Msk
#define SERC_IER4_PDRIE129_Pos        (1U)
#define SERC_IER4_PDRIE129_Msk        (0x1UL << SERC_IER4_PDRIE129_Pos)   /*!< 0x00000002 */
#define SERC_IER4_PDRIE129            SERC_IER4_PDRIE129_Msk
#define SERC_IER4_PDRIE130_Pos        (2U)
#define SERC_IER4_PDRIE130_Msk        (0x1UL << SERC_IER4_PDRIE130_Pos)   /*!< 0x00000004 */
#define SERC_IER4_PDRIE130            SERC_IER4_PDRIE130_Msk
#define SERC_IER4_PDRIE131_Pos        (3U)
#define SERC_IER4_PDRIE131_Msk        (0x1UL << SERC_IER4_PDRIE131_Pos)   /*!< 0x00000008 */
#define SERC_IER4_PDRIE131            SERC_IER4_PDRIE131_Msk
#define SERC_IER4_PDRIE132_Pos        (4U)
#define SERC_IER4_PDRIE132_Msk        (0x1UL << SERC_IER4_PDRIE132_Pos)   /*!< 0x00000010 */
#define SERC_IER4_PDRIE132            SERC_IER4_PDRIE132_Msk
#define SERC_IER4_PDRIE133_Pos        (5U)
#define SERC_IER4_PDRIE133_Msk        (0x1UL << SERC_IER4_PDRIE133_Pos)   /*!< 0x00000020 */
#define SERC_IER4_PDRIE133            SERC_IER4_PDRIE133_Msk
#define SERC_IER4_PDRIE134_Pos        (6U)
#define SERC_IER4_PDRIE134_Msk        (0x1UL << SERC_IER4_PDRIE134_Pos)   /*!< 0x00000040 */
#define SERC_IER4_PDRIE134            SERC_IER4_PDRIE134_Msk
#define SERC_IER4_PDRIE135_Pos        (7U)
#define SERC_IER4_PDRIE135_Msk        (0x1UL << SERC_IER4_PDRIE135_Pos)   /*!< 0x00000080 */
#define SERC_IER4_PDRIE135            SERC_IER4_PDRIE135_Msk
#define SERC_IER4_PDRIE136_Pos        (8U)
#define SERC_IER4_PDRIE136_Msk        (0x1UL << SERC_IER4_PDRIE136_Pos)   /*!< 0x00000100 */
#define SERC_IER4_PDRIE136            SERC_IER4_PDRIE136_Msk
#define SERC_IER4_PDRIE137_Pos        (9U)
#define SERC_IER4_PDRIE137_Msk        (0x1UL << SERC_IER4_PDRIE137_Pos)   /*!< 0x00000200 */
#define SERC_IER4_PDRIE137            SERC_IER4_PDRIE137_Msk
#define SERC_IER4_PDRIE138_Pos        (10U)
#define SERC_IER4_PDRIE138_Msk        (0x1UL << SERC_IER4_PDRIE138_Pos)   /*!< 0x00000400 */
#define SERC_IER4_PDRIE138            SERC_IER4_PDRIE138_Msk
#define SERC_IER4_PDRIE139_Pos        (11U)
#define SERC_IER4_PDRIE139_Msk        (0x1UL << SERC_IER4_PDRIE139_Pos)   /*!< 0x00000800 */
#define SERC_IER4_PDRIE139            SERC_IER4_PDRIE139_Msk
#define SERC_IER4_PDRIE140_Pos        (12U)
#define SERC_IER4_PDRIE140_Msk        (0x1UL << SERC_IER4_PDRIE140_Pos)   /*!< 0x00001000 */
#define SERC_IER4_PDRIE140            SERC_IER4_PDRIE140_Msk
#define SERC_IER4_PDRIE141_Pos        (13U)
#define SERC_IER4_PDRIE141_Msk        (0x1UL << SERC_IER4_PDRIE141_Pos)   /*!< 0x00002000 */
#define SERC_IER4_PDRIE141            SERC_IER4_PDRIE141_Msk
#define SERC_IER4_PDRIE142_Pos        (14U)
#define SERC_IER4_PDRIE142_Msk        (0x1UL << SERC_IER4_PDRIE142_Pos)   /*!< 0x00004000 */
#define SERC_IER4_PDRIE142            SERC_IER4_PDRIE142_Msk
#define SERC_IER4_PDRIE143_Pos        (15U)
#define SERC_IER4_PDRIE143_Msk        (0x1UL << SERC_IER4_PDRIE143_Pos)   /*!< 0x00008000 */
#define SERC_IER4_PDRIE143            SERC_IER4_PDRIE143_Msk
#define SERC_IER4_PDRIE144_Pos        (16U)
#define SERC_IER4_PDRIE144_Msk        (0x1UL << SERC_IER4_PDRIE144_Pos)   /*!< 0x00010000 */
#define SERC_IER4_PDRIE144            SERC_IER4_PDRIE144_Msk
#define SERC_IER4_PDRIE145_Pos        (17U)
#define SERC_IER4_PDRIE145_Msk        (0x1UL << SERC_IER4_PDRIE145_Pos)   /*!< 0x00020000 */
#define SERC_IER4_PDRIE145            SERC_IER4_PDRIE145_Msk
#define SERC_IER4_PDRIE146_Pos        (18U)
#define SERC_IER4_PDRIE146_Msk        (0x1UL << SERC_IER4_PDRIE146_Pos)   /*!< 0x00040000 */
#define SERC_IER4_PDRIE146            SERC_IER4_PDRIE146_Msk
#define SERC_IER4_PDRIE147_Pos        (19U)
#define SERC_IER4_PDRIE147_Msk        (0x1UL << SERC_IER4_PDRIE147_Pos)   /*!< 0x00080000 */
#define SERC_IER4_PDRIE147            SERC_IER4_PDRIE147_Msk
#define SERC_IER4_PDRIE148_Pos        (20U)
#define SERC_IER4_PDRIE148_Msk        (0x1UL << SERC_IER4_PDRIE148_Pos)   /*!< 0x00100000 */
#define SERC_IER4_PDRIE148            SERC_IER4_PDRIE148_Msk
#define SERC_IER4_PDRIE149_Pos        (21U)
#define SERC_IER4_PDRIE149_Msk        (0x1UL << SERC_IER4_PDRIE149_Pos)   /*!< 0x00200000 */
#define SERC_IER4_PDRIE149            SERC_IER4_PDRIE149_Msk
#define SERC_IER4_PDRIE150_Pos        (22U)
#define SERC_IER4_PDRIE150_Msk        (0x1UL << SERC_IER4_PDRIE150_Pos)   /*!< 0x00400000 */
#define SERC_IER4_PDRIE150            SERC_IER4_PDRIE150_Msk
#define SERC_IER4_PDRIE151_Pos        (23U)
#define SERC_IER4_PDRIE151_Msk        (0x1UL << SERC_IER4_PDRIE151_Pos)   /*!< 0x00800000 */
#define SERC_IER4_PDRIE151            SERC_IER4_PDRIE151_Msk
#define SERC_IER4_PDRIE152_Pos        (24U)
#define SERC_IER4_PDRIE152_Msk        (0x1UL << SERC_IER4_PDRIE152_Pos)   /*!< 0x01000000 */
#define SERC_IER4_PDRIE152            SERC_IER4_PDRIE152_Msk
#define SERC_IER4_PDRIE153_Pos        (25U)
#define SERC_IER4_PDRIE153_Msk        (0x1UL << SERC_IER4_PDRIE153_Pos)   /*!< 0x02000000 */
#define SERC_IER4_PDRIE153            SERC_IER4_PDRIE153_Msk
#define SERC_IER4_PDRIE154_Pos        (26U)
#define SERC_IER4_PDRIE154_Msk        (0x1UL << SERC_IER4_PDRIE154_Pos)   /*!< 0x04000000 */
#define SERC_IER4_PDRIE154            SERC_IER4_PDRIE154_Msk
#define SERC_IER4_PDRIE155_Pos        (27U)
#define SERC_IER4_PDRIE155_Msk        (0x1UL << SERC_IER4_PDRIE155_Pos)   /*!< 0x08000000 */
#define SERC_IER4_PDRIE155            SERC_IER4_PDRIE155_Msk
#define SERC_IER4_PDRIE156_Pos        (28U)
#define SERC_IER4_PDRIE156_Msk        (0x1UL << SERC_IER4_PDRIE156_Pos)   /*!< 0x10000000 */
#define SERC_IER4_PDRIE156            SERC_IER4_PDRIE156_Msk
#define SERC_IER4_PDRIE157_Pos        (29U)
#define SERC_IER4_PDRIE157_Msk        (0x1UL << SERC_IER4_PDRIE157_Pos)   /*!< 0x20000000 */
#define SERC_IER4_PDRIE157            SERC_IER4_PDRIE157_Msk
#define SERC_IER4_PDRIE158_Pos        (30U)
#define SERC_IER4_PDRIE158_Msk        (0x1UL << SERC_IER4_PDRIE158_Pos)   /*!< 0x40000000 */
#define SERC_IER4_PDRIE158            SERC_IER4_PDRIE158_Msk
#define SERC_IER4_PDRIE159_Pos        (31U)
#define SERC_IER4_PDRIE159_Msk        (0x1UL << SERC_IER4_PDRIE159_Pos)   /*!< 0x80000000 */
#define SERC_IER4_PDRIE159            SERC_IER4_PDRIE159_Msk

