STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_ca35.h
#define USBH_EHCI_HCCPARAMS_ISO_Pos        (4U)
#define USBH_EHCI_HCCPARAMS_ISO_Msk        (0xFU << USBH_EHCI_HCCPARAMS_ISO_Pos)             /*!< 0x000000F0 */
#define USBH_EHCI_HCCPARAMS_ISO            USBH_EHCI_HCCPARAMS_ISO_Msk                       /*!< Isochronous Scheduling Threshold */

#define USBH_EHCI_HCCPARAMS_EECP_Pos       (8U)
#define USBH_EHCI_HCCPARAMS_EECP_Msk       (0xFFU << USBH_EHCI_HCCPARAMS_EECP_Pos)           /*!< 0x0000FF00 */
#define USBH_EHCI_HCCPARAMS_EECP           USBH_EHCI_HCCPARAMS_EECP_Msk                      /*!< EHCI Extended Capabilities Pointer */

#define USBH_EHCI_HCCPARAMS_LPM_Pos        (17U)
#define USBH_EHCI_HCCPARAMS_LPM_Msk        (0x1U << USBH_EHCI_HCCPARAMS_LPM_Pos)             /*!< 0x00020000 */
#define USBH_EHCI_HCCPARAMS_LPM            USBH_EHCI_HCCPARAMS_LPM_Msk                       /*!< Link Power Management Capability */

#define USBH_EHCI_HCCPARAMS_PPCE_Pos       (18U)
#define USBH_EHCI_HCCPARAMS_PPCE_Msk       (0x1U << USBH_EHCI_HCCPARAMS_PPCE_Pos)            /*!< 0x00040000 */
#define USBH_EHCI_HCCPARAMS_PPCE           USBH_EHCI_HCCPARAMS_PPCE_Msk                      /*!< Per-Port Change Event Capability */

#define USBH_EHCI_HCCPARAMS_32FPC_Pos      (19U)
#define USBH_EHCI_HCCPARAMS_32FPC_Msk      (0x1U << USBH_EHCI_HCCPARAMS_32FPC_Pos)           /*!< 0x00080000 */
#define USBH_EHCI_HCCPARAMS_32FPC          USBH_EHCI_HCCPARAMS_32FPC_Msk                     /*!< 32-Frame Periodic List Capability */

/********************  Bit definition for USBH_EHCI_USBCMD register  ***********************/
#define USBH_EHCI_USBCMD_RS_Pos            (0U)
#define USBH_EHCI_USBCMD_RS_Msk            (0x1U << USBH_EHCI_USBCMD_RS_Pos)                 /*!< 0x00000001 */
#define USBH_EHCI_USBCMD_RS                USBH_EHCI_USBCMD_RS_Msk                           /*!< Run/Stop */

#define USBH_EHCI_USBCMD_HCRESET_Pos       (1U)
#define USBH_EHCI_USBCMD_HCRESET_Msk       (0x1U << USBH_EHCI_USBCMD_HCRESET_Pos)            /*!< 0x00000002 */
#define USBH_EHCI_USBCMD_HCRESET           USBH_EHCI_USBCMD_HCRESET_Msk                      /*!< Host Controller Reset */

#define USBH_EHCI_USBCMD_FLS_Pos           (2U)
#define USBH_EHCI_USBCMD_FLS_Msk           (0x3U << USBH_EHCI_USBCMD_FLS_Pos)                /*!< 0x0000000C */
#define USBH_EHCI_USBCMD_FLS               USBH_EHCI_USBCMD_FLS_Msk                          /*!< Frame List Size */

#define USBH_EHCI_USBCMD_PSE_Pos           (4U)
#define USBH_EHCI_USBCMD_PSE_Msk           (0x1U << USBH_EHCI_USBCMD_PSE_Pos)                /*!< 0x00000010 */
#define USBH_EHCI_USBCMD_PSE               USBH_EHCI_USBCMD_PSE_Msk                          /*!< Periodic Schedule Enable */

#define USBH_EHCI_USBCMD_ASE_Pos           (5U)
#define USBH_EHCI_USBCMD_ASE_Msk           (0x1U << USBH_EHCI_USBCMD_ASE_Pos)                /*!< 0x00000020 */
#define USBH_EHCI_USBCMD_ASE               USBH_EHCI_USBCMD_ASE_Msk                          /*!< Asynchronous Schedule Enable */

#define USBH_EHCI_USBCMD_IAA_Pos           (6U)
#define USBH_EHCI_USBCMD_IAA_Msk           (0x1U << USBH_EHCI_USBCMD_IAA_Pos)                /*!< 0x00000040 */
#define USBH_EHCI_USBCMD_IAA               USBH_EHCI_USBCMD_IAA_Msk                          /*!< Interrupt on Async Advance Doorbell */

#define USBH_EHCI_USBCMD_LHCRESET_Pos      (7U)
#define USBH_EHCI_USBCMD_LHCRESET_Msk      (0x1U << USBH_EHCI_USBCMD_LHCRESET_Pos)           /*!< 0x00000080 */
#define USBH_EHCI_USBCMD_LHCRESET          USBH_EHCI_USBCMD_LHCRESET_Msk                     /*!< Light Host Controller Reset (OPTIONAL) */

#define USBH_EHCI_USBCMD_ASPMC_Pos         (8U)
#define USBH_EHCI_USBCMD_ASPMC_Msk         (0x3U << USBH_EHCI_USBCMD_ASPMC_Pos)              /*!< 0x00000300 */
#define USBH_EHCI_USBCMD_ASPMC             USBH_EHCI_USBCMD_ASPMC_Msk                        /*!< Asynchronous Schedule Park Mode Count (OPTIONAL) */

#define USBH_EHCI_USBCMD_ASPME_Pos         (11U)
#define USBH_EHCI_USBCMD_ASPME_Msk         (0x1U << USBH_EHCI_USBCMD_ASPME_Pos)              /*!< 0x00000800 */
#define USBH_EHCI_USBCMD_ASPME             USBH_EHCI_USBCMD_ASPME_Msk                        /*!< Asynchronous Schedule Park Mode Enable (OPTIONAL) */

#define USBH_EHCI_USBCMD_ITC_Pos           (16U)
#define USBH_EHCI_USBCMD_ITC_Msk           (0xFFU << USBH_EHCI_USBCMD_ITC_Pos)               /*!< 0x00FF0000 */
#define USBH_EHCI_USBCMD_ITC               USBH_EHCI_USBCMD_ITC_Msk                          /*!< Interrupt Threshold Control */

#define USBH_EHCI_USBCMD_HIRD_Pos          (24U)
#define USBH_EHCI_USBCMD_HIRD_Msk          (0xFU << USBH_EHCI_USBCMD_HIRD_Pos)               /*!< 0x0F000000 */
#define USBH_EHCI_USBCMD_HIRD              USBH_EHCI_USBCMD_HIRD_Msk                         /*!< Host-Initiated Resume Duration */

/********************  Bit definition for USBH_EHCI_USBSTS register  ***********************/
#define USBH_EHCI_USBSTS_USBINT_Pos        (0U)
#define USBH_EHCI_USBSTS_USBINT_Msk        (0x1U << USBH_EHCI_USBSTS_USBINT_Pos)             /*!< 0x00000001 */
#define USBH_EHCI_USBSTS_USBINT            USBH_EHCI_USBSTS_USBINT_Msk                       /*!< USB Interrupt (USBINT) */

#define USBH_EHCI_USBSTS_USBERRINT_Pos     (1U)
#define USBH_EHCI_USBSTS_USBERRINT_Msk     (0x1U << USBH_EHCI_USBSTS_USBERRINT_Pos)          /*!< 0x00000002 */
#define USBH_EHCI_USBSTS_USBERRINT         USBH_EHCI_USBSTS_USBERRINT_Msk                    /*!< USB Error Interrupt (USBERRINT) */

#define USBH_EHCI_USBSTS_PCD_Pos           (2U)
#define USBH_EHCI_USBSTS_PCD_Msk           (0x1U << USBH_EHCI_USBSTS_PCD_Pos)                /*!< 0x00000004 */
#define USBH_EHCI_USBSTS_PCD               USBH_EHCI_USBSTS_PCD_Msk                          /*!< Port Change Detect */

#define USBH_EHCI_USBSTS_FLR_Pos           (3U)
#define USBH_EHCI_USBSTS_FLR_Msk           (0x1U << USBH_EHCI_USBSTS_FLR_Pos)                /*!< 0x00000008 */
#define USBH_EHCI_USBSTS_FLR               USBH_EHCI_USBSTS_FLR_Msk                          /*!< Frame List Rollover */

