STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_ca35.h
#define USBH_EHCI_USBSTS_HSE_Pos           (4U)
#define USBH_EHCI_USBSTS_HSE_Msk           (0x1U << USBH_EHCI_USBSTS_HSE_Pos)                /*!< 0x00000010 */
#define USBH_EHCI_USBSTS_HSE               USBH_EHCI_USBSTS_HSE_Msk                          /*!< Host System Error */

#define USBH_EHCI_USBSTS_IAA_Pos           (5U)
#define USBH_EHCI_USBSTS_IAA_Msk           (0x1U << USBH_EHCI_USBSTS_IAA_Pos)                /*!< 0x00000020 */
#define USBH_EHCI_USBSTS_IAA               USBH_EHCI_USBSTS_IAA_Msk                          /*!< Interrupt on Async Advance */

#define USBH_EHCI_USBSTS_HCH_Pos           (12U)
#define USBH_EHCI_USBSTS_HCH_Msk           (0x1U << USBH_EHCI_USBSTS_HCH_Pos)                /*!< 0x00001000 */
#define USBH_EHCI_USBSTS_HCH               USBH_EHCI_USBSTS_HCH_Msk                          /*!< HCHalted */

#define USBH_EHCI_USBSTS_RECL_Pos          (13U)
#define USBH_EHCI_USBSTS_RECL_Msk          (0x1U << USBH_EHCI_USBSTS_RECL_Pos)               /*!< 0x00002000 */
#define USBH_EHCI_USBSTS_RECL              USBH_EHCI_USBSTS_RECL_Msk                         /*!< Reclamation */

#define USBH_EHCI_USBSTS_PSS_Pos           (14U)
#define USBH_EHCI_USBSTS_PSS_Msk           (0x1U << USBH_EHCI_USBSTS_PSS_Pos)                /*!< 0x00004000 */
#define USBH_EHCI_USBSTS_PSS               USBH_EHCI_USBSTS_PSS_Msk                          /*!< Periodic Schedule Status */

#define USBH_EHCI_USBSTS_ASS_Pos           (15U)
#define USBH_EHCI_USBSTS_ASS_Msk           (0x1U << USBH_EHCI_USBSTS_ASS_Pos)                /*!< 0x00008000 */
#define USBH_EHCI_USBSTS_ASS               USBH_EHCI_USBSTS_ASS_Msk                          /*!< Asynchronous Schedule Status */

/********************  Bit definition for USBH_EHCI_USBINTR register  **********************/
#define USBH_EHCI_USBINTR_USBIE_Pos        (0U)
#define USBH_EHCI_USBINTR_USBIE_Msk        (0x1U << USBH_EHCI_USBINTR_USBIE_Pos)             /*!< 0x00000001 */
#define USBH_EHCI_USBINTR_USBIE            USBH_EHCI_USBINTR_USBIE_Msk                       /*!< USB Interrupt Enable */

#define USBH_EHCI_USBINTR_USBEIE_Pos       (1U)
#define USBH_EHCI_USBINTR_USBEIE_Msk       (0x1U << USBH_EHCI_USBINTR_USBEIE_Pos)            /*!< 0x00000002 */
#define USBH_EHCI_USBINTR_USBEIE           USBH_EHCI_USBINTR_USBEIE_Msk                      /*!< USB Error Interrupt Enable */

#define USBH_EHCI_USBINTR_PCIE_Pos         (2U)
#define USBH_EHCI_USBINTR_PCIE_Msk         (0x1U << USBH_EHCI_USBINTR_PCIE_Pos)              /*!< 0x00000004 */
#define USBH_EHCI_USBINTR_PCIE             USBH_EHCI_USBINTR_PCIE_Msk                        /*!< Port Change Interrupt Enable */

#define USBH_EHCI_USBINTR_FLRE_Pos         (3U)
#define USBH_EHCI_USBINTR_FLRE_Msk         (0x1U << USBH_EHCI_USBINTR_FLRE_Pos)              /*!< 0x00000008 */
#define USBH_EHCI_USBINTR_FLRE             USBH_EHCI_USBINTR_FLRE_Msk                        /*!< Frame List Rollover Enable */

#define USBH_EHCI_USBINTR_HSEE_Pos         (4U)
#define USBH_EHCI_USBINTR_HSEE_Msk         (0x1U << USBH_EHCI_USBINTR_HSEE_Pos)              /*!< 0x00000010 */
#define USBH_EHCI_USBINTR_HSEE             USBH_EHCI_USBINTR_HSEE_Msk                        /*!< Host System Error Enable */

#define USBH_EHCI_USBINTR_IAAE_Pos         (5U)
#define USBH_EHCI_USBINTR_IAAE_Msk         (0x1U << USBH_EHCI_USBINTR_IAAE_Pos)              /*!< 0x00000020 */
#define USBH_EHCI_USBINTR_IAAE             USBH_EHCI_USBINTR_IAAE_Msk                        /*!< Interrupt on Async Advance Enable */

/********************  Bit definition for USBH_EHCI_FRINDEX register  **********************/
#define USBH_EHCI_FRINDEX_FRAMEINDEX_Pos   (0U)
#define USBH_EHCI_FRINDEX_FRAMEINDEX_Msk   (0x3FFFU << USBH_EHCI_FRINDEX_FRAMEINDEX_Pos)     /*!< 0x00003FFF */
#define USBH_EHCI_FRINDEX_FRAMEINDEX       USBH_EHCI_FRINDEX_FRAMEINDEX_Msk                  /*!< Frame Index */

/********************  Bit definition for USBH_EHCI_CTRLDSSEGMENT register  ****************/
#define USBH_EHCI_CTRLDSSEGMENT_SEGMENT_Pos (0U)
#define USBH_EHCI_CTRLDSSEGMENT_SEGMENT_Msk (0xFFFFFFFFU << USBH_EHCI_CTRLDSSEGMENT_SEGMENT_Pos) /*!< 0xFFFFFFFF */
#define USBH_EHCI_CTRLDSSEGMENT_SEGMENT     USBH_EHCI_CTRLDSSEGMENT_SEGMENT_Msk                  /*!< Control Data Structure Segment */

/********************  Bit definition for USBH_EHCI_PERIODICLISTBASE register  *************/
#define USBH_EHCI_PERIODICLISTBASE_BASEADDR_Pos (12U)
#define USBH_EHCI_PERIODICLISTBASE_BASEADDR_Msk (0xFFFFFU << USBH_EHCI_PERIODICLISTBASE_BASEADDR_Pos) /*!< 0xFFFFF000 */
#define USBH_EHCI_PERIODICLISTBASE_BASEADDR     USBH_EHCI_PERIODICLISTBASE_BASEADDR_Msk                /*!< Base Address (Low) */

/********************  Bit definition for USBH_EHCI_ASYNCLISTADDR register  ****************/
#define USBH_EHCI_ASYNCLISTADDR_LPL_Pos    (5U)
#define USBH_EHCI_ASYNCLISTADDR_LPL_Msk    (0x7FFFFFFU << USBH_EHCI_ASYNCLISTADDR_LPL_Pos)    /*!< 0xFFFFFFE0 */
#define USBH_EHCI_ASYNCLISTADDR_LPL        USBH_EHCI_ASYNCLISTADDR_LPL_Msk                   /*!< Link Pointer Low (LPL) */

/********************  Bit definition for USBH_EHCI_CONFIGFLAG register  *******************/
#define USBH_EHCI_CONFIGFLAG_CF_Pos        (0U)
#define USBH_EHCI_CONFIGFLAG_CF_Msk        (0x1U << USBH_EHCI_CONFIGFLAG_CF_Pos)             /*!< 0x00000001 */
#define USBH_EHCI_CONFIGFLAG_CF            USBH_EHCI_CONFIGFLAG_CF_Msk                       /*!< Configure Flag (CF) */

/********************  Bit definition for USBH_EHCI_PORTSC register  ***********************/
#define USBH_EHCI_PORTSC_CCS_Pos           (0U)
#define USBH_EHCI_PORTSC_CCS_Msk           (0x1U << USBH_EHCI_PORTSC_CCS_Pos)                /*!< 0x00000001 */
#define USBH_EHCI_PORTSC_CCS               USBH_EHCI_PORTSC_CCS_Msk                          /*!< Current Connect Status */

#define USBH_EHCI_PORTSC_CSC_Pos           (1U)
#define USBH_EHCI_PORTSC_CSC_Msk           (0x1U << USBH_EHCI_PORTSC_CSC_Pos)                /*!< 0x00000002 */
#define USBH_EHCI_PORTSC_CSC               USBH_EHCI_PORTSC_CSC_Msk                          /*!< Connect Status Change */

